{"info": {"institution": "and Darryn Dieken to cover an overview of the key technology pillars of Longhorn", "occupation": "ANIL NORI: I think the fundamental thing that the file system application will see is they can find their data. Right now you can create lots of your data, you can store it some place in some folders; lots of times people struggle with \"well, I know that I created this file, I know that I created this e-mail, but I don\\'t know where it is.\" Bringing, finding and searching your data is a fundamental value that will be provided by WinFS. We talk about three things; we talk about find, relate, and act on it. So you can find the data, where it is in your store, you can just find it by doing some querying on it. And once you have found things you can relate things. I have a document and I want to relate the document with some contact because that contact happens to be author of that. I may find documents based on who authored it and are based on the address of the author. So you would be able to do that. And finally, you can also associate rich business logic on it. If you\\'re really storing your calendar items you may want to associate rich logic and you can associate that. Beyond just really being a passive bit bucket, it provides rich structure, rich searching, rich relationships and rich business logic associated with that", "summary": "Anil Nori works as a ANIL NORI: I think the fundamental thing that the file system application will see is they can find their data. Right now you can create lots of your data, you can store it some place in some folders; lots of times people struggle with \"well, I know that I created this file, I know that I created this e-mail, but I don\\'t know where it is.\" Bringing, finding and searching your data is a fundamental value that will be provided by WinFS. We talk about three things; we talk about find, relate, and act on it. So you can find the data, where it is in your store, you can just find it by doing some querying on it. And once you have found things you can relate things. I have a document and I want to relate the document with some contact because that contact happens to be author of that. I may find documents based on who authored it and are based on the address of the author. So you would be able to do that. And finally, you can also associate rich business logic on it. If you\\'re really storing your calendar items you may want to associate rich logic and you can associate that. Beyond just really being a passive bit bucket, it provides rich structure, rich searching, rich relationships and rich business logic associated with that in and Darryn Dieken to cover an overview of the key technology pillars of Longhorn, and his\\her h-index is 7, g-index is 17. His\\Her interests are :\n Data Model; Distributed Database; Application Developm...; Database Management; Device;", "org": "unknown", "numberOfFollowers": 0, "interests": ["Data Model", "Distributed Database", "Application Developm...", "Database Management", "Device"]}, "name": "Anil Nori", "am_id": "53f433dbdabfaee43ec16521"}