{"info": {"institution": "University of California, Los Angeles", "occupation": "Plot Written, directed, and edited by James Lee, You Fang Chu Zu (Room to Let) centers around Berg (Berg Lee), whose method of recovering from an old relationship consists mainly of smoking, watching television, and digging into a seemingly endless supply of instant noodles. Despite his coach-potato existence, Berg\\'s fellow boarders seem drawn to him, and let him into their borderline obsession with an artist who had disappeared from the house three years earlier in a rumored attempt to avoid marrying his cousin. Before long, Berg inexplicably finds his own consciousness mixing into that of the long-absent roommate, and eventually comes upon the cousin in question bound and gagged in another room. The film also features Kiew Suet Kim, Andrew Low, Ling Tan, Chong Sheon Wei, Koh Choon Eiow, Bernard Chauly, and Amy Len. ~ Tracie Cooper, All Movie Guide", "summary": "Fang Chu works as a Plot Written, directed, and edited by James Lee, You Fang Chu Zu (Room to Let) centers around Berg (Berg Lee), whose method of recovering from an old relationship consists mainly of smoking, watching television, and digging into a seemingly endless supply of instant noodles. Despite his coach-potato existence, Berg\\'s fellow boarders seem drawn to him, and let him into their borderline obsession with an artist who had disappeared from the house three years earlier in a rumored attempt to avoid marrying his cousin. Before long, Berg inexplicably finds his own consciousness mixing into that of the long-absent roommate, and eventually comes upon the cousin in question bound and gagged in another room. The film also features Kiew Suet Kim, Andrew Low, Ling Tan, Chong Sheon Wei, Koh Choon Eiow, Bernard Chauly, and Amy Len. ~ Tracie Cooper, All Movie Guide in University of California, Los Angeles, and his\\her h-index is 7, g-index is 14. His\\Her interests are :\n Data Mining; Concept Drift; Confidence Interval; Missing Values; Antithetic Variate;", "org": "unknown", "numberOfFollowers": 0, "interests": ["Data Mining", "Concept Drift", "Confidence Interval", "Missing Values", "Antithetic Variate"]}, "name": "Fang Chu", "am_id": "53f461ebdabfaefedbb77838"}