{"info": {"institution": "Bellcore, 444 Hoes Lane, Piscataway, NJ", "occupation": "Gomer Thomas my Great Grandather is shown in this photo with his wife Margaret and children and was taken during WW1. The children are as follows. Back row Dan and Will, front from left, Blodwen, Beatrice, Dai, Tom, Gwyn, Phoebe and last but not least Mary my grandmother. Gomer Thomas was born 5th December 1875 at Engineer\\'s Row, Abernant,Aberdare. He was the son of Daniel Thomas and Mary Thomas (formerly Williams). Both of his parents were from the Llanelli area. Gomer married his wife Margaret Harry 2nd May 1896 at Tumble in Carmarthenshire. They moved to Senghenydd where Gomer had previously worked sinking the mine.The house they lived in and where my Grandmother was born was demolished some years back, but was virtually opposite where I now live.They also lived in Abertridwr which is just down the valley from Senghenydd. Gomer worked in the Universal pit in Senghenydd and was one of the lucky ones who was off shift when the two pit disasters happened. During WW1 he was in 19th Pioneer Battalion of the Welsh Regiment. He was Town Crier for Abertridwr for many years and won the British Town Crier championship three times. First time at Pewsey Wiltshire in 1925. Second time at the Torrington fair, Devon, in 1930", "summary": "Gomer Thomas works as a Gomer Thomas my Great Grandather is shown in this photo with his wife Margaret and children and was taken during WW1. The children are as follows. Back row Dan and Will, front from left, Blodwen, Beatrice, Dai, Tom, Gwyn, Phoebe and last but not least Mary my grandmother. Gomer Thomas was born 5th December 1875 at Engineer\\'s Row, Abernant,Aberdare. He was the son of Daniel Thomas and Mary Thomas (formerly Williams). Both of his parents were from the Llanelli area. Gomer married his wife Margaret Harry 2nd May 1896 at Tumble in Carmarthenshire. They moved to Senghenydd where Gomer had previously worked sinking the mine.The house they lived in and where my Grandmother was born was demolished some years back, but was virtually opposite where I now live.They also lived in Abertridwr which is just down the valley from Senghenydd. Gomer worked in the Universal pit in Senghenydd and was one of the lucky ones who was off shift when the two pit disasters happened. During WW1 he was in 19th Pioneer Battalion of the Welsh Regiment. He was Town Crier for Abertridwr for many years and won the British Town Crier championship three times. First time at Pewsey Wiltshire in 1925. Second time at the Torrington fair, Devon, in 1930 in Bellcore, 444 Hoes Lane, Piscataway, NJ, and his\\her h-index is 5, g-index is 13. His\\Her interests are :\n", "org": "unknown", "numberOfFollowers": 0, "interests": []}, "name": "Gomer Thomas", "am_id": "53f44233dabfaee43ec6ffe4"}