{"info": {"institution": "University of Washington, Seattle, WA", "occupation": "Jens-Erik Mai is Assistant Professor in the Information School and Co-Director of the Center for Human-Information Interaction at the University of Washington. He teaches classes on indexing, classification, design of controlled vocabularies, and the theoretical foundation of information science. His research focuses on domain-centered approaches to organization and representation of information and he is particularly interested in understanding how people use information in their workplaces and how information could best be organized and represented to support their work. He approaches this from theoretical as well as empirical perspectives, drawing on semiotics, philosophy of language, domain analysis, and Cognitive Work Analysis", "summary": "Jens-Erik Mai works as a Jens-Erik Mai is Assistant Professor in the Information School and Co-Director of the Center for Human-Information Interaction at the University of Washington. He teaches classes on indexing, classification, design of controlled vocabularies, and the theoretical foundation of information science. His research focuses on domain-centered approaches to organization and representation of information and he is particularly interested in understanding how people use information in their workplaces and how information could best be organized and represented to support their work. He approaches this from theoretical as well as empirical perspectives, drawing on semiotics, philosophy of language, domain analysis, and Cognitive Work Analysis in University of Washington, Seattle, WA, and his\\her h-index is 6, g-index is 19. His\\Her interests are :\n Classification; Controlled Vocabular...; Epistemology; Indexation; Information System;", "org": "unknown", "numberOfFollowers": 0, "interests": ["Classification", "Controlled Vocabular...", "Epistemology", "Indexation", "Information System"]}, "name": "Jens-Erik Mai", "am_id": "53f383b0dabfae4b34a05496"}