{"info": {"institution": "* Resource Centers", "occupation": "John Mark Agosta develops diagnostic, optimization and statistical models to improve Intel products and processes. Previously he developed automation for customer relationship management software while working at Edify Corporation. Most notably he incorporated statistical language methods into the product for automated response to customer inquiries. From 1998-2000 he was chief technical officer for Knowledge Industries, where he built Bayes networks for medical, avionics and automobile clients. From 1992 to 1998 he worked as a research engineer at SRI International where he served as the technical lead to create several automated reasoning software tools. He built models for electric utility generator alarm filtering and computer network intrusion detection. He also worked in automated planning for emergency response and USAF air campaign planning. Agosta received his Ph. D. in the Engineering-Economic Systems Department (now Management Science and Engineering) of Stanford University in 1991. His thesis topic was on an application of Bayes networks to visual recognition. At Stanford he participated in the early development of Bayes networks methods. While in graduate school he consulted for Apple Computer, Grainger, (now DSC), Opcom (now Lucent) and IBM. He lives in Palo Alto with his wife, Margaret, and their twins, Alex and Isabella", "summary": "John Mark Agosta works as a John Mark Agosta develops diagnostic, optimization and statistical models to improve Intel products and processes. Previously he developed automation for customer relationship management software while working at Edify Corporation. Most notably he incorporated statistical language methods into the product for automated response to customer inquiries. From 1998-2000 he was chief technical officer for Knowledge Industries, where he built Bayes networks for medical, avionics and automobile clients. From 1992 to 1998 he worked as a research engineer at SRI International where he served as the technical lead to create several automated reasoning software tools. He built models for electric utility generator alarm filtering and computer network intrusion detection. He also worked in automated planning for emergency response and USAF air campaign planning. Agosta received his Ph. D. in the Engineering-Economic Systems Department (now Management Science and Engineering) of Stanford University in 1991. His thesis topic was on an application of Bayes networks to visual recognition. At Stanford he participated in the early development of Bayes networks methods. While in graduate school he consulted for Apple Computer, Grainger, (now DSC), Opcom (now Lucent) and IBM. He lives in Palo Alto with his wife, Margaret, and their twins, Alex and Isabella in * Resource Centers, and his\\her h-index is 11, g-index is 23. His\\Her interests are :\n Bayes Network; Influence Diagram; Decision Support; Disputed Claim; End-host Detector;", "org": "unknown", "numberOfFollowers": 0, "interests": ["Bayes Network", "Influence Diagram", "Decision Support", "Disputed Claim", "End-host Detector"]}, "name": "John Mark Agosta", "am_id": "53f45690dabfaefedbb51135"}