{"info": {"institution": "University of Dortmund", "occupation": "About From January 1998 to March 2003, Ralf Klinkenberg was a research and teaching assistant and now is a Ph. D. student of Prof. Dr. Katharina Morik at the Artificial Intelligence Unit of University of Dortmund in Dortmund, Germany. He received his Diplom in Computer Science from the University of Dortmund in 1998. In 1994/95 he studied at University of Missouri-Rolla (UMR) in Rolla, Missouri, USA, for a year with a grant of the German-American Fulbright Commission. In 1996 he completed his studies at UMR as a Master of Science in Computer Science. His research interests are in the fields of machine learning, data mining, and knowledge discovery, with a focus on learning drifting concepts from time-varying data streams and machine learning with text. In 1992 he won a price in the national German computer science competition \"Bundeswettbewerb Informatik\" for pupils and young students organized by the German Informatics society (GI)", "summary": "Ralf Klinkenberg works as a About From January 1998 to March 2003, Ralf Klinkenberg was a research and teaching assistant and now is a Ph. D. student of Prof. Dr. Katharina Morik at the Artificial Intelligence Unit of University of Dortmund in Dortmund, Germany. He received his Diplom in Computer Science from the University of Dortmund in 1998. In 1994/95 he studied at University of Missouri-Rolla (UMR) in Rolla, Missouri, USA, for a year with a grant of the German-American Fulbright Commission. In 1996 he completed his studies at UMR as a Master of Science in Computer Science. His research interests are in the fields of machine learning, data mining, and knowledge discovery, with a focus on learning drifting concepts from time-varying data streams and machine learning with text. In 1992 he won a price in the national German computer science competition \"Bundeswettbewerb Informatik\" for pupils and young students organized by the German Informatics society (GI) in University of Dortmund, and his\\her h-index is 11, g-index is 23. His\\Her interests are :\n", "org": "unknown", "numberOfFollowers": 0, "interests": []}, "name": "Ralf Klinkenberg", "am_id": "53f4434cdabfaee1c0ae092c"}